In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.290161  0.756015
1    a  two -0.316766  0.060264
2    b  one -1.322666 -0.173157
3    b  two  0.248203 -1.239806
4    a  one  0.528369  0.893573

In [2]:
df.groupby(by="key1")[['data1','data2']].sum()

         data1     data2
key1
a    -1.078558  1.709852
b    -1.074463 -1.412963

In [3]:
df1 = df.groupby(by=['key1','key2']).sum()
df1.columns.name = "data"
df1

data          data1     data2
key1 key2
a    one  -0.761792  1.649588
     two  -0.316766  0.060264
b    one  -1.322666 -0.173157
     two   0.248203 -1.239806

In [4]:

df1.stack().unstack(level=['key2','data'])

key2       one                 two
data     data1     data2     data1     data2
key1
a    -0.761792  1.649588 -0.316766  0.060264
b    -1.322666 -0.173157  0.248203 -1.239806